{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 384, 384, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_9"}, "name": "input_9", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "efficientnetv2-s", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 384, 384, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn", "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "stem_activation", "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1a_project_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1a_project_conv", "inbound_nodes": [[["stem_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1a_project_bn", "inbound_nodes": [[["block1a_project_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1a_project_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block1a_project_activation", "inbound_nodes": [[["block1a_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block1a_add", "trainable": false, "dtype": "float32"}, "name": "block1a_add", "inbound_nodes": [[["block1a_project_activation", 0, 0, {}], ["stem_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1b_project_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1b_project_conv", "inbound_nodes": [[["block1a_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1b_project_bn", "inbound_nodes": [[["block1b_project_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1b_project_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block1b_project_activation", "inbound_nodes": [[["block1b_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block1b_add", "trainable": false, "dtype": "float32"}, "name": "block1b_add", "inbound_nodes": [[["block1b_project_activation", 0, 0, {}], ["block1a_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_expand_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_expand_conv", "inbound_nodes": [[["block1b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_expand_bn", "inbound_nodes": [[["block2a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2a_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2a_expand_activation", "inbound_nodes": [[["block2a_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2a_project_conv", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2a_project_conv", "inbound_nodes": [[["block2a_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2a_project_bn", "inbound_nodes": [[["block2a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_expand_conv", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_expand_conv", "inbound_nodes": [[["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_expand_bn", "inbound_nodes": [[["block2b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2b_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2b_expand_activation", "inbound_nodes": [[["block2b_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2b_project_conv", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2b_project_conv", "inbound_nodes": [[["block2b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2b_project_bn", "inbound_nodes": [[["block2b_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2b_add", "trainable": false, "dtype": "float32"}, "name": "block2b_add", "inbound_nodes": [[["block2b_project_bn", 0, 0, {}], ["block2a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_expand_conv", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_expand_conv", "inbound_nodes": [[["block2b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_expand_bn", "inbound_nodes": [[["block2c_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2c_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2c_expand_activation", "inbound_nodes": [[["block2c_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2c_project_conv", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2c_project_conv", "inbound_nodes": [[["block2c_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2c_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2c_project_bn", "inbound_nodes": [[["block2c_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2c_add", "trainable": false, "dtype": "float32"}, "name": "block2c_add", "inbound_nodes": [[["block2c_project_bn", 0, 0, {}], ["block2b_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2d_expand_conv", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2d_expand_conv", "inbound_nodes": [[["block2c_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2d_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2d_expand_bn", "inbound_nodes": [[["block2d_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2d_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2d_expand_activation", "inbound_nodes": [[["block2d_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2d_project_conv", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2d_project_conv", "inbound_nodes": [[["block2d_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2d_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2d_project_bn", "inbound_nodes": [[["block2d_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2d_add", "trainable": false, "dtype": "float32"}, "name": "block2d_add", "inbound_nodes": [[["block2d_project_bn", 0, 0, {}], ["block2c_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_expand_conv", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_expand_conv", "inbound_nodes": [[["block2d_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_expand_bn", "inbound_nodes": [[["block3a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3a_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3a_expand_activation", "inbound_nodes": [[["block3a_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3a_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3a_project_conv", "inbound_nodes": [[["block3a_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3a_project_bn", "inbound_nodes": [[["block3a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_expand_conv", "inbound_nodes": [[["block3a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3b_expand_bn", "inbound_nodes": [[["block3b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3b_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3b_expand_activation", "inbound_nodes": [[["block3b_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3b_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3b_project_conv", "inbound_nodes": [[["block3b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3b_project_bn", "inbound_nodes": [[["block3b_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block3b_add", "trainable": false, "dtype": "float32"}, "name": "block3b_add", "inbound_nodes": [[["block3b_project_bn", 0, 0, {}], ["block3a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3c_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3c_expand_conv", "inbound_nodes": [[["block3b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3c_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3c_expand_bn", "inbound_nodes": [[["block3c_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3c_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3c_expand_activation", "inbound_nodes": [[["block3c_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3c_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3c_project_conv", "inbound_nodes": [[["block3c_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3c_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3c_project_bn", "inbound_nodes": [[["block3c_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block3c_add", "trainable": false, "dtype": "float32"}, "name": "block3c_add", "inbound_nodes": [[["block3c_project_bn", 0, 0, {}], ["block3b_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3d_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3d_expand_conv", "inbound_nodes": [[["block3c_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3d_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3d_expand_bn", "inbound_nodes": [[["block3d_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3d_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3d_expand_activation", "inbound_nodes": [[["block3d_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3d_project_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3d_project_conv", "inbound_nodes": [[["block3d_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3d_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3d_project_bn", "inbound_nodes": [[["block3d_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block3d_add", "trainable": false, "dtype": "float32"}, "name": "block3d_add", "inbound_nodes": [[["block3d_project_bn", 0, 0, {}], ["block3c_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4a_expand_conv", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4a_expand_conv", "inbound_nodes": [[["block3d_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4a_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4a_expand_bn", "inbound_nodes": [[["block4a_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4a_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4a_expand_activation", "inbound_nodes": [[["block4a_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block4a_dwconv2", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block4a_dwconv2", "inbound_nodes": [[["block4a_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4a_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4a_bn", "inbound_nodes": [[["block4a_dwconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4a_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4a_activation", "inbound_nodes": [[["block4a_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block4a_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block4a_se_squeeze", "inbound_nodes": [[["block4a_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block4a_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 256]}, "name": "block4a_se_reshape", "inbound_nodes": [[["block4a_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4a_se_reduce", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4a_se_reduce", "inbound_nodes": [[["block4a_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4a_se_expand", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4a_se_expand", "inbound_nodes": [[["block4a_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block4a_se_excite", "trainable": false, "dtype": "float32"}, "name": "block4a_se_excite", "inbound_nodes": [[["block4a_activation", 0, 0, {}], ["block4a_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4a_project_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4a_project_conv", "inbound_nodes": [[["block4a_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4a_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4a_project_bn", "inbound_nodes": [[["block4a_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4b_expand_conv", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4b_expand_conv", "inbound_nodes": [[["block4a_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4b_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4b_expand_bn", "inbound_nodes": [[["block4b_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4b_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4b_expand_activation", "inbound_nodes": [[["block4b_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block4b_dwconv2", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block4b_dwconv2", "inbound_nodes": [[["block4b_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4b_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4b_bn", "inbound_nodes": [[["block4b_dwconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4b_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4b_activation", "inbound_nodes": [[["block4b_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block4b_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block4b_se_squeeze", "inbound_nodes": [[["block4b_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block4b_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 512]}, "name": "block4b_se_reshape", "inbound_nodes": [[["block4b_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4b_se_reduce", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4b_se_reduce", "inbound_nodes": [[["block4b_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4b_se_expand", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4b_se_expand", "inbound_nodes": [[["block4b_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block4b_se_excite", "trainable": false, "dtype": "float32"}, "name": "block4b_se_excite", "inbound_nodes": [[["block4b_activation", 0, 0, {}], ["block4b_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4b_project_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4b_project_conv", "inbound_nodes": [[["block4b_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4b_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4b_project_bn", "inbound_nodes": [[["block4b_project_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block4b_add", "trainable": false, "dtype": "float32"}, "name": "block4b_add", "inbound_nodes": [[["block4b_project_bn", 0, 0, {}], ["block4a_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4c_expand_conv", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4c_expand_conv", "inbound_nodes": [[["block4b_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4c_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4c_expand_bn", "inbound_nodes": [[["block4c_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4c_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4c_expand_activation", "inbound_nodes": [[["block4c_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block4c_dwconv2", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block4c_dwconv2", "inbound_nodes": [[["block4c_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4c_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4c_bn", "inbound_nodes": [[["block4c_dwconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4c_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4c_activation", "inbound_nodes": [[["block4c_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block4c_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block4c_se_squeeze", "inbound_nodes": [[["block4c_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block4c_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 512]}, "name": "block4c_se_reshape", "inbound_nodes": [[["block4c_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4c_se_reduce", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4c_se_reduce", "inbound_nodes": [[["block4c_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4c_se_expand", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4c_se_expand", "inbound_nodes": [[["block4c_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block4c_se_excite", "trainable": false, "dtype": "float32"}, "name": "block4c_se_excite", "inbound_nodes": [[["block4c_activation", 0, 0, {}], ["block4c_se_expand", 0, 0, {}]]]}, 